/*
 * _________________________________________________________________________
 * |     __   __  ______   ______              __    _  _______  _______     |
 * |     \ \ / / |  ____| |  ____|     _      |  \  | ||  _____||  _____|    |
 * |      \   /  | |      | |____     (_)     |   \ | || |_____ | |_____     |
 * |       | |   | |      |____  |    _       | |\   ||  _____| \____  |     |
 * |       | |   | |____   ____| |   (_)      | | \  || |_____  _____| |     |
 * |       |_|   |______| |______|            |_|  \_||_______||_______|     |
 * |        Y C s y s                          N E S   C O R E               |
 * |_________________________________________________________________________|
 * |                                                                         |
 * |      [A]  YCsys NES CORE - AUDIO PROCESSING UNIT (APU)     [A]          |
 * |      Yurii Code system (YCsys) © 2026. Код, що працює, а не існує.      |
 * |      Started: 2026-05-11 | Project: YCsys-NES-Core                      |
 * |_________________________________________________________________________|
 * [SND]        [PUL]        [TRI]        [NSI]        [DAC]        [SND]
 */

#include "APU.h"

APU::APU() {}
APU::~APU() {}

void APU::cpuWrite(uint16_t addr, uint8_t data) {
    // Логіку керування каналами Pulse, Triangle, Noise додамо у наступних ТЗ
    (void)addr;
    (void)data;
}

uint8_t APU::cpuRead(uint16_t addr) {
    (void)addr;
    uint8_t data = 0x00;
    // Логіка читання статус-регістра APU ($4015) буде тут
    return data;
}

void APU::clock() {
    // APU крок
}

double APU::GetOutputSample() {
    // Поки що повертаємо повну тишу (0.0)
    return 0.0;
}