#pragma once
#include <cstdint>

// Знову попереднє оголошення, щоб CPU знав про існування шини
class Bus;

class CPU6502 {
public:
    CPU6502();
    ~CPU6502();

    // Підключення процесора до шини (щоб він міг читати/писати)
    void ConnectBus(Bus* n) { bus = n; }

public:
    // ТЕХНІЧНЕ ЗАВДАННЯ: 
    // Оголосіть тут регістри процесора згідно з планом.
    // Підказка щодо типів даних: 
    // - Акумулятор (A), індекси (X, Y), вказівник стека (S) та статус (P) вміщують 1 байт.
    // - Лічильник команд (PC - Program Counter) має вміщувати адресу пам'яті (від 0x0000 до 0xFFFF), тому він більший.

    uint8_t  a = 0x00;      // Акумулятор (Accumulator)
    // ... ДОДАЙТЕ ІНШІ РЕГІСТРИ ТУТ (X, Y, PC, S, status/P) ...


    // Прапорці статусу (Status Flags) - C Z I D B U V N
    // Ми використовуємо enum для визначення позиції кожного прапорця у 8-бітному регістрі статусу.
    enum FLAGS6502 {
        C = (1 << 0),   // Carry Bit (Перенесення)
        Z = (1 << 1),   // Zero (Нуль)
        I = (1 << 2),   // Disable Interrupts (Вимкнення переривань)
        D = (1 << 3),   // Decimal Mode (Десятковий режим - в NES не використовується, але є в процесорі)
        B = (1 << 4),   // Break (Програмне переривання)
        U = (1 << 5),   // Unused (Не використовується, завжди 1)
        V = (1 << 6),   // Overflow (Переповнення)
        N = (1 << 7)    // Negative (Від'ємне число)
    };

private:
    // Вказівник на головну шину
    Bus* bus = nullptr;

    // Внутрішні функції CPU для зручного спілкування з шиною
    uint8_t read(uint16_t addr);
    void write(uint16_t addr, uint8_t data);
};