/*
 * _________________________________________________________________________
 * |     __   __  ______   ______              __    _  _______  _______     |
 * |     \ \ / / |  ____| |  ____|     _      |  \  | ||  _____||  _____|    |
 * |      \   /  | |      | |____     (_)     |   \ | || |_____ | |_____     |
 * |       | |   | |      |____  |    _       | |\   ||  _____| \____  |     |
 * |       | |   | |____   ____| |   (_)      | | \  || |_____  _____| |     |
 * |       |_|   |______| |______|            |_|  \_||_______||_______|     |
 * |        Y C s y s                          N E S   C O R E               |
 * |_________________________________________________________________________|
 * |                                                                         |
 * |      [!]  YCsys NES CORE - MAIN ENTRY POINT & SYSTEM LOOP  [!]          |
 * |      Yurii Code system (YCsys) © 2026. Код, що працює, а не існує.      |
 * |      Started: 2026-05-11 | Project: YCsys-NES-Core                      |
 * |_________________________________________________________________________|
 * [PWR]        [JOY]        [RST]        [SYS]        [PWR]
 */

#include <iostream>
#include "Bus.h"
#include "CPU.h"

// Це виправить твою помилку SDL_main
#define SDL_MAIN_HANDLED // це говорить SDL, що ми не хочемо, щоб він замінював нашу функцію main() на свою власну версію, яка викликається при запуску програми. Це корисно, коли ти хочеш мати повний контроль над точкою входу в програму і не хочеш, щоб SDL втручався в це.

int main(int argc, char* argv[]) {
    // Створюємо екземпляри твоїх систем
    Bus nesBus;
    CPU6502 nesCpu;

    // З'єднуємо їх за твоїм планом
    nesCpu.ConnectBus(&nesBus);

    // Скидаємо процесор (тут спрацює твій код із Reset Vector)
    nesCpu.reset();

    std::cout << "YCsys NES Core: System Initialized." << std::endl;
    std::cout << "Code that works, not just exists." << std::endl;

    return 0;
}